gyr0code/micropython/ports/stm32/adc.c
    SendDataPeak();

}

/*void HAL_ADC_ConvCpltCallback(ADC_HandleTypeDef *adch){

    NVIC_DisableIRQ(DMA2_Stream4_IRQn);

    pos_counter=(90*udp_counter)%360;

    if(pos_counter == 270){
        
        for(a=0; a<90; a++){
            udp_buffer[pos_counter+a] = aADCConvertedValues[a];
        }

        mp_send_udp(UDPS->pcb, (u32_t*)udp_buffer, &UDPS->destip, UDPS->port, 1440);
   
    }

    else{
        for(a=0; a<90; a++){
            udp_buffer[pos_counter+a] = aADCConvertedValues[a];
        }
    }

    udp_counter++;
    
    if(udp_counter==100){

        sys_cyclesB = DWT->CYCCNT;
        printf("%lu\n", sys_cyclesB-sys_cyclesA);
        //HAL_ADCEx_MultiModeStop_DMA(adch);
        adc_dma_DeInit(adch);
        led_toggle(PYB_LED_GREEN);
        printf("END OF CONVERSION\n");
        udp_counter = 0;

    }

NVIC_EnableIRQ(DMA2_Stream4_IRQn);

}*/


static void Error_Handler(void){
    printf("ERROR!\n");
}

// Reset system ticks
static void DWT_config(void){
    
    CoreDebug->DEMCR |= CoreDebug_DEMCR_TRCENA_Msk;
    DWT->CYCCNT = 0;
    DWT->CTRL |= DWT_CTRL_CYCCNTENA_Msk;

}

void SendDataPeak(void){
  if (peakNum < NUMBER_PEAKS-8) {
    
    uint32_t time_us = 0;
    uint32_t val1 = 0;
    uint32_t val2 = 0;
  
    for (int n = 0; n < DMA_BUFFER_SIZE; n++) {
      val1 = (0xFFFF & aADCConvertedValues[n]);
      val2 = (0xFFFF & (aADCConvertedValues[n] >> 16));
      if (in_peak == 0) {
        if (val1 > PP_THR || val2 > PP_THR) {
          //sampleIdx = 0;
          in_peak = 1;
          time_s = seconds;
          cycl = DWT->CYCCNT;
        }
      } 
      else {
        if (val1 > max_adc) {
          max_adc = val1;
        }
        if (val2> max_adc) {
          max_adc = val2;
        }
        //sampleIdx++;
        if (val1 < PP_THR || val2 < PP_THR ) {
          in_peak = 0;
          //if (sampleIdx >= PP_WINDOW_MIN && sampleIdx <= PP_WINDOW_MAX) {
            //found peak
            if ((cycl - last_cycles) > 0) {
              time_us = (cycl - last_cycles) / PP_CLK_MHZ;
            } else {
              time_us = (4294967295 + cycl - last_cycles) / PP_CLK_MHZ;
            }
            payload[peakNum * 2] = time_s;
            payload[peakNum * 2 + 1] = (time_us << 12) | (max_adc);
            peakNum++;
            max_adc = 0;
            //Pull stretcher pulse down again
          //}
        }
      }
    }
    if (peakNum >= NUMBER_PEAKS - 8) {
      //udp_send_data((u8_t *)payload, peakNum*8);
        mp_send_udp(UDPS->pcb, (u32_t*)payload, &UDPS->destip, UDPS->port, peakNum*8);
        peakNum = 0;
        totpeakNum = totpeakNum + peakNum;
    }
  }
}
/*if(totpeakNum > tot_samples){
    adc_dma_DeInit(adch);
}
*/

/*
static void adc_dma_DeInit(ADC_HandleTypeDef *adch){

        if(HAL_ADC_Stop_DMA(adch) != HAL_OK){
            Error_Handler();}
        
        dma_deinit(&dma_ADC_1);

}*/

typedef struct _pyb_obj_adc_t {
    mp_obj_base_t base;
    mp_obj_t pin_name;
    int channel;
    bool tri_mode;
    ADC_HandleTypeDef handle;
    ADC_HandleTypeDef handle2;
    ADC_HandleTypeDef handle3;
} pyb_obj_adc_t;

// convert user-facing channel number into internal channel number
static inline uint32_t adc_get_internal_channel(uint32_t channel) {
    #if defined(STM32F4) || defined(STM32F7)
    // on F4 and F7 MCUs we want channel 16 to always be the TEMPSENSOR
    // (on some MCUs ADC_CHANNEL_TEMPSENSOR=16, on others it doesn't)
    if (channel == 16) {
        channel = ADC_CHANNEL_TEMPSENSOR;
    }
    #endif
    return channel;
}

STATIC bool is_adcx_channel(int channel) {
#if defined(STM32F411xE)
    // The HAL has an incorrect IS_ADC_CHANNEL macro for the F411 so we check for temp
    return IS_ADC_CHANNEL(channel) || channel == ADC_CHANNEL_TEMPSENSOR;
#elif defined(STM32F0) || defined(STM32F4) || defined(STM32F7) || defined(STM32H7)
    return IS_ADC_CHANNEL(channel);
#elif defined(STM32L4)
    ADC_HandleTypeDef handle;
    handle.Instance = ADCx;
    return IS_ADC_CHANNEL(&handle, channel);
#else
    #error Unsupported processor
#endif
}

STATIC void adc_wait_for_eoc_or_timeout(int32_t timeout) {
    uint32_t tickstart = HAL_GetTick();
#if defined(STM32F4) || defined(STM32F7)
    while ((ADCx->SR & ADC_FLAG_EOC) != ADC_FLAG_EOC) {
#elif defined(STM32F0) || defined(STM32H7) || defined(STM32L4)
    while (READ_BIT(ADCx->ISR, ADC_FLAG_EOC) != ADC_FLAG_EOC) {
#else
    #error Unsupported processor
#endif
        if (((HAL_GetTick() - tickstart ) > timeout)) {
            break; // timeout
        }
    }
}

STATIC void adcx_clock_enable(void) {
#if defined(STM32F0) || defined(STM32F4) || defined(STM32F7)
    ADCx_CLK_ENABLE();

#elif defined(STM32H7)
    __HAL_RCC_ADC3_CLK_ENABLE();
    __HAL_RCC_ADC_CONFIG(RCC_ADCCLKSOURCE_CLKP);
#elif defined(STM32L4)
    __HAL_RCC_ADC_CLK_ENABLE();
#else
    #error Unsupported processor
#endif
}

STATIC void adc_slaveclk_enable(void){
    __HAL_RCC_ADC2_CLK_ENABLE();
    __HAL_RCC_ADC3_CLK_ENABLE();
}

STATIC void adc_dma_init_periph(ADC_HandleTypeDef *adch, ADC_HandleTypeDef *adch2, ADC_HandleTypeDef *adch3, bool tri_mode){
    
    adcx_clock_enable();

    if(tri_mode){

        adc_slaveclk_enable();
        
        adch3->Instance                   = ADC3;

        adch3->Init.Resolution            = ADC_RESOLUTION_12B;
        adch3->Init.ContinuousConvMode    = ENABLE;
        adch3->Init.DiscontinuousConvMode = DISABLE;
        adch3->Init.EOCSelection          = DISABLE;
        adch3->Init.ExternalTrigConv      = ADC_EXTERNALTRIGCONV_T1_CC1;
        adch3->Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
        adch3->Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV2;
        adch3->Init.ScanConvMode          = DISABLE;
        adch3->Init.DataAlign             = ADC_DATAALIGN_RIGHT;
        adch3->Init.DMAContinuousRequests = DISABLE;
        
        if(HAL_ADC_Init(adch3) != HAL_OK){
            Error_Handler();
        }
        
        adch2->Instance                   = ADC2;

        adch2->Init.Resolution            = ADC_RESOLUTION_12B;
        adch2->Init.ContinuousConvMode    = ENABLE;
        adch2->Init.DiscontinuousConvMode = DISABLE;
        adch2->Init.EOCSelection          = DISABLE;
        adch2->Init.ExternalTrigConv      = ADC_EXTERNALTRIGCONV_T1_CC1;
        adch2->Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
        adch2->Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV2;
        adch2->Init.ScanConvMode          = DISABLE;
        adch2->Init.DataAlign             = ADC_DATAALIGN_RIGHT;
        adch2->Init.DMAContinuousRequests = DISABLE;

        if(HAL_ADC_Init(adch2) != HAL_OK){
            Error_Handler();
        }
    }

    adch->Instance                   = ADC1;

    adch->Init.Resolution            = ADC_RESOLUTION_12B;
    adch->Init.ContinuousConvMode    = ENABLE; 
    adch->Init.DiscontinuousConvMode = DISABLE;
    adch->Init.EOCSelection          = DISABLE;
    adch->Init.ExternalTrigConv      = ADC_EXTERNALTRIGCONV_T1_CC1;
    adch->Init.ExternalTrigConvEdge  = ADC_EXTERNALTRIGCONVEDGE_NONE;
    adch->Init.ClockPrescaler        = ADC_CLOCK_SYNC_PCLK_DIV2;
    adch->Init.ScanConvMode          = DISABLE;
    adch->Init.DataAlign             = ADC_DATAALIGN_RIGHT;
    adch->Init.DMAContinuousRequests = ENABLE;

    if(HAL_ADC_Init(adch) != HAL_OK){
        Error_Handler();
    }

    static DMA_HandleTypeDef DMAHandle;

